# 6. Пользователь вводит номер буквы в алфавите. Определить, какая это буква.
print(chr(int(input('Введите номер буквы из латинского алфавита :')) + 96))